# vim: set ft=ruby

brew 'bat'
brew 'asciinema'
brew 'agg'
brew 'eza'
brew 'btop'
brew 'git'
brew 'zsh'
brew 'bash'
brew 'make'
brew 'cmake'
brew 'openssl'
brew 'coreutils'
brew 'gnu-tar'
brew 'graphicsmagick'
brew 'fzf'
brew 'ripgrep'
brew 'markdown'
brew 'multimarkdown'
brew 'direnv'
brew 'ffmpeg'
brew 'wget'
brew 'curl'
brew 'gnu-sed'
brew 'z'
brew 'cloc'
brew 'jq'
brew 'tree'
brew 'gh'
brew 'sqlite3'
brew 'pandoc'
brew 'graphviz'
brew 'gcc'
brew 'moreutils'
brew 'watch'
brew 'shellcheck'

brew 'shfmt'
brew 'pgrep'
brew 'pkill'
brew 'neovim'
brew 'atuin'
brew 'btop'
brew 'neofetch'

# See: https://apple.stackexchange.com/questions/431812/how-can-i-stop-a-bluetooth-keyboard-from-waking-my-macbook-pro/437396#437396
brew 'sleepwatcher'
brew 'blueutil'

cask 'postgres-unofficial'
brew 'livekit'
brew 'postgrest'
brew 'foreman'

cask 'soundsource'
cask 'jiggler'
cask 'rectangle'
cask 'slack'
cask 'istat-menus'
cask 'zoom'
cask 'spotify'
cask 'vlc'
cask 'visual-studio-code'
cask 'postico'
cask 'imageoptim'
# cask 'barrier'
cask 'discord'
cask 'orbstack'
cask 'vmware-fusion'
cask 'monodraw'
cask 'imageoptim'
cask 'handbrake'
# terminal emulators
brew 'ghostty'


tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-jetbrains-mono'
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-ibm-plex'

# mas 'Xcode', id: 497799835
# mas 'Pixelmator Pro', id: 1289583905
# mas 'Microsoft Word', id: 462054704
# mas 'Microsoft Excel', id: 462058435
